Jmeter-test/Generacion_Reportes_Financieros.jmx
<jmeterTestPlan><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Generaci&#243;n de Reportes Financieros" enabled="true"><stringProp name="TestPlan.comments" /><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments" /><stringProp name="TestPlan.user_define_classpath" /></TestPlan><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Usuarios Concurrentes" enabled="true"><stringProp name="ThreadGroup.num_threads">1000</stringProp><stringProp name="ThreadGroup.ramp_time">300</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp></ThreadGroup><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Solicitud de Reporte Financiero" enabled="true"><stringProp name="HTTPSampler.domain">localhost</stringProp><stringProp name="HTTPSampler.port">8080</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.path">/generateReport</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp></HTTPSamplerProxy></hashTree></jmeterTestPlan>